/* Вариант 8
Анкета для опроса населения содержит две группы вопросов. Первая группа содержит сведения о респонденте:
o	возраст;
o	пол;
o	образование (начальное,	среднее, высшее).
Вторая группа содержит собственно вопрос анкеты, ответом на который может являться либо ДА, либо НЕТ.
Написать программу, которая:
o	обеспечивает начальный ввод анкет и формирует из них стека или очереди;
o	на основе анализа анкет выдает ответы на следующие вопросы:
    а) сколько мужчин старше 40 лет, имеющих высшее образование, ответили ДА на вопрос анкеты;
    б) сколько женщин моложе 30 лет, имеющих среднее образование, ответили НЕТ на вопрос анкеты;
    в) сколько мужчин моложе 25 лет, имеющих начальное образование, ответили ДА на вопрос анкеты;
o	производит вывод всех анкет и ответов на вопросы.
Программа должна обеспечивать диалог с помощью меню и контроль ошибок при вводе. */